Repository: adrienmalin/PySudoku
Catalog: locale/*/LC_MESSAGES/PySudoku.po
Languages: fr

source: Grid
fr: Grille

source: Generate...
fr: Générer...

source: Create
fr: Créer

source: Edit
fr: Éditer

source: Validate
fr: Valider

source: Solve
fr: Résoudre

source: Game
fr: Partie

source: Load...
fr: Charger...

source: Save...
fr: Sauvegarder...

source: Restart...
fr: Redémarrer...

source: View
fr: Affichage

source: Theme
fr: Thème

source: Show tips
fr: Afficher les info-bulles

source: Show conflicts
fr: Afficher les conflits

source: Wikipedia
fr: Wikipédia

source: About...
fr: À propos...

source: Grid generation
fr: Génération d'une grille

source: Generating a new grid...
fr: Génération d'une nouvelle grille...

source: Deleting clues...
fr: Suppression d'indices...

source: Stop
fr: Arrêter

source: Grid validation
fr: Validation de la grille

source: Checking if grid has a solution...
fr: Vérification que la grille a une solution...

source: Can't solve grid
fr: Grille insoluble

source: Some boxes have no solution. Please correct it.
fr: La grille comporte des cases sans valeur possible. Corrigez-les pour pouvoir valider la grille.

source: Checking if grid has other solutions...
fr: Vérification qu'il n'y a pas d'autres solution...

source: Incorrect grid
fr: Grille incorrecte

source: The grid has several solutions.
fr: La grille a plusieurs solutions possibles.

source: Some boxes from the same row, column or region have same digit. Please correct them.
fr: La grille comporte des cases d'une même colonne, ligne ou région avec des valeurs identiques. Veuillez les corriger.

source: Solving grid
fr: Résolution de la grille

source: Calculating sure digits...
fr: Calcul des valeurs sûres...

source: Test: {} on {}
fr: Essai : {} en {}

source: There are some error. Please correct them to solve the grid.
fr: La grille comporte des erreurs. Corrigez-les pour pouvoir résoudre la grille.

source: Cancelled
fr: Annulation

source: Congratulations!
fr: Bravo !

source: The grid is solved.
fr: La grille est résolue.

source: Generate a new grid
fr: Générer une nouvelle grille

source: Please enter minimum number of clues:
fr: Entrez le nombre minimum d'indices :

source: ← harder
fr: ← plus difficile

source: easier →
fr: plus → facile

source: Cancel
fr: Annuler

source: Cancelling...
fr: Annulation...

source: Stopping...
fr: Arrêt...

source: Erase current game?
fr: Effacer la partie en cours ?

source: A game is in progress. Do you want to erase it?
fr: Une partie est en cours. Voulez-vous l'effacer ?

source: Open game
fr: Ouvrir une partie

source: PySudoku game
fr: Partie PySudoku

source: File error
fr: Erreur de fichier

source: The file {} can't be read.
fr: Le fichier {} n'a pas pu être lu.

source: The file {} can't be found.
fr: Le fichier {} n'a pas été trouvé.

source: Save game
fr: Enregistrer la partie

source: https://en.wikipedia.org/wiki/Sudoku
fr: https://fr.wikipedia.org/wiki/Sudoku

source: About PySudoku
fr: À propos de PySudoku

source: Author: Adrien Malingrey Licence: MIT
fr: Auteur : Adrien Malingrey Licence : MIT

source: Save game?
fr: Enregistrer la partie ?

source: A game is in progress. Would you like to save it?
fr: Une partie est en cours. Voulez-vous l'enregistrer ?
